RESULTS/PERFCNTR/sqlite_fullpersist_enablelog_HWCNTR_all.out
Enter application name and arguments as params for the script
Keys:       16 bytes each
Values:     100 bytes each
Entries:    300000
RawSize:    33.2 MB (estimated)
------------------------------------------------
fillseq      :      13.904 micros/op;    8.0 MB/s
fillseqsync  :      13.306 micros/op;    8.3 MB/s (3000 ops)
fillseqbatch :       5.205 micros/op;   21.3 MB/s
fillrandom   :      18.420 micros/op;    6.0 MB/s
fillrandsync :      15.309 micros/op;    7.2 MB/s (3000 ops)
fillrandbatch :      11.926 micros/op;    9.3 MB/s
overwrite    :      21.981 micros/op;    5.0 MB/s
overwritebatch :      17.279 micros/op;    6.4 MB/s
readrandom   :       4.566 micros/op;
readseq      :       1.549 micros/op;   61.6 MB/s
fillrand100K :     463.123 micros/op;  206.0 MB/s (300 ops)
fillseq100K  :     442.293 micros/op;  215.7 MB/s (300 ops)
readseq      :      18.197 micros/op; 5240.9 MB/s
readrand100K :      20.583 micros/op;
             :       0.000 micros/op;
-------------------------------------------------------------
-------------------------------------------------------------
CPU type:	Intel Core Haswell processor 
CPU clock:	3.39 GHz 
-------------------------------------------------------------
/home/sudarsun/libs/linux-examples/leveldb-1.14.0/db_bench_mem_sqlite3_wal
+-------------------------------------------+-------------+-------------+--------+--------+--------+--------+-------------+--------+
|                   Event                   |   core 0    |   core 1    | core 2 | core 3 | core 4 | core 5 |   core 6    | core 7 |
+-------------------------------------------+-------------+-------------+--------+--------+--------+--------+-------------+--------+
|             INSTR_RETIRED_ANY             | 1.07612e+11 | 2.1634e+09  | 67167  | 612603 |   0    | 35440  | 1.08712e+09 |   0    |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM | 3.37037e+07 | 2.41622e+06 |  3179  |  1014  |   0    |  895   |   885040    |   0    |
|           MEM_UOP_RETIRED_LOADS           | 4.60464e+10 | 6.85481e+08 | 12443  | 128715 |   0    | 10250  | 3.31227e+08 |   0    |
|          MEM_UOP_RETIRED_STORES           | 1.99521e+10 | 2.51475e+08 |  5547  | 60582  |   0    |  5855  | 2.79005e+08 |   0    |
|             INSTR_RETIRED_ANY             | 1.07612e+11 | 2.1634e+09  | 67167  | 612603 |   0    | 35440  | 1.08712e+09 |   0    |
|           CPU_CLK_UNHALTED_CORE           | 7.8862e+10  | 1.02787e+09 | 361351 | 759430 |   0    | 327837 | 1.80774e+09 |   0    |
|           CPU_CLK_UNHALTED_REF            | 6.87677e+10 | 8.97902e+08 | 318104 | 663238 |   0    | 287300 | 1.57876e+09 |   0    |
+-------------------------------------------+-------------+-------------+--------+--------+--------+--------+-------------+--------+
+------------------------------------------------+-------------+-------------+-----+-------------+
|                     Event                      |     Sum     |     Max     | Min |     Avg     |
+------------------------------------------------+-------------+-------------+-----+-------------+
|             INSTR_RETIRED_ANY STAT             | 1.10864e+11 | 1.07612e+11 |  0  | 1.3858e+10  |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM STAT | 3.70101e+07 | 3.37037e+07 |  0  | 4.62626e+06 |
|           MEM_UOP_RETIRED_LOADS STAT           | 4.70632e+10 | 4.60464e+10 |  0  | 5.8829e+09  |
|          MEM_UOP_RETIRED_STORES STAT           | 2.04826e+10 | 1.99521e+10 |  0  | 2.56033e+09 |
|             INSTR_RETIRED_ANY STAT             | 1.10864e+11 | 1.07612e+11 |  0  | 1.3858e+10  |
|           CPU_CLK_UNHALTED_CORE STAT           | 8.16991e+10 | 7.8862e+10  |  0  | 1.02124e+10 |
|           CPU_CLK_UNHALTED_REF STAT            | 7.12456e+10 | 6.87677e+10 |  0  | 8.9057e+09  |
+------------------------------------------------+-------------+-------------+-----+-------------+
+----------------------+----------+----------+-------------+-------------+---------+-------------+---------+---------+
|        Metric        |  core 0  |  core 1  |   core 2    |   core 3    | core 4  |   core 5    | core 6  | core 7  |
+----------------------+----------+----------+-------------+-------------+---------+-------------+---------+---------+
| Runtime (RDTSC) [s]  | 28.8499  | 28.8499  |   28.8499   |   28.8499   | 28.8499 |   28.8499   | 28.8499 | 28.8499 |
| Runtime unhalted [s] | 23.2489  | 0.303021 | 0.000106528 | 0.000223884 |    0    | 9.66481e-05 | 0.53293 |    0    |
|     Clock [MHz]      | 3889.99  | 3883.06  |   3853.23   |   3884.04   |    0    |   3870.68   | 3884.04 |    0    |
|         CPI          | 0.732834 | 0.475117 |   5.37989   |   1.23968   |    0    |   9.25048   | 1.66287 |    0    |
+----------------------+----------+----------+-------------+-------------+---------+-------------+---------+---------+
Enter application name and arguments as params for the script
Keys:       16 bytes each
Values:     100 bytes each
Entries:    300000
RawSize:    33.2 MB (estimated)
------------------------------------------------
fillseq      :      13.976 micros/op;    7.9 MB/s
fillseqsync  :      13.365 micros/op;    8.3 MB/s (3000 ops)
fillseqbatch :       5.153 micros/op;   21.5 MB/s
fillrandom   :      18.451 micros/op;    6.0 MB/s
fillrandsync :      15.366 micros/op;    7.2 MB/s (3000 ops)
fillrandbatch :      11.919 micros/op;    9.3 MB/s
overwrite    :      22.029 micros/op;    5.0 MB/s
overwritebatch :      17.296 micros/op;    6.4 MB/s
readrandom   :       4.541 micros/op;
readseq      :       1.560 micros/op;   61.1 MB/s
fillrand100K :     467.023 micros/op;  204.2 MB/s (300 ops)
fillseq100K  :     444.860 micros/op;  214.4 MB/s (300 ops)
readseq      :      18.016 micros/op; 5293.3 MB/s
readrand100K :      20.947 micros/op;
             :       0.000 micros/op;
-------------------------------------------------------------
-------------------------------------------------------------
CPU type:	Intel Core Haswell processor 
CPU clock:	3.39 GHz 
-------------------------------------------------------------
/home/sudarsun/libs/linux-examples/leveldb-1.14.0/db_bench_mem_sqlite3_wal
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+-------------+--------+--------+
|                   Event                   |   core 0    |   core 1    |   core 2    |   core 3    | core 4 |   core 5    | core 6 | core 7 |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+-------------+--------+--------+
|             INSTR_RETIRED_ANY             | 1.07612e+11 | 2.19195e+09 | 8.96342e+08 | 2.05842e+08 |   0    | 8.50465e+06 |   0    |  2849  |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM | 3.40921e+07 | 2.25192e+06 | 1.42959e+06 |   159587    |   0    |    8486     |   0    |   60   |
|           MEM_UOP_RETIRED_LOADS           | 4.60464e+10 | 6.95777e+08 | 2.73333e+08 | 6.19855e+07 |   0    | 2.25223e+06 |   0    |  661   |
|          MEM_UOP_RETIRED_STORES           | 1.99521e+10 | 2.66283e+08 | 2.15803e+08 | 5.13038e+07 |   0    | 1.18756e+06 |   0    |  469   |
|             INSTR_RETIRED_ANY             | 1.07612e+11 | 2.19195e+09 | 8.96342e+08 | 2.05842e+08 |   0    | 8.50465e+06 |   0    |  2849  |
|           CPU_CLK_UNHALTED_CORE           | 7.89517e+10 | 1.15111e+09 | 1.37029e+09 | 3.31011e+08 |   0    | 1.18013e+07 |   0    | 35296  |
|           CPU_CLK_UNHALTED_REF            | 6.88412e+10 | 1.00605e+09 | 1.19605e+09 | 2.89888e+08 |   0    | 1.05691e+07 |   0    | 31586  |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+-------------+--------+--------+
+------------------------------------------------+-------------+-------------+-----+-------------+
|                     Event                      |     Sum     |     Max     | Min |     Avg     |
+------------------------------------------------+-------------+-------------+-----+-------------+
|             INSTR_RETIRED_ANY STAT             | 1.10915e+11 | 1.07612e+11 |  0  | 1.38644e+10 |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM STAT | 3.79418e+07 | 3.40921e+07 |  0  | 4.74272e+06 |
|           MEM_UOP_RETIRED_LOADS STAT           | 4.70797e+10 | 4.60464e+10 |  0  | 5.88497e+09 |
|          MEM_UOP_RETIRED_STORES STAT           | 2.04867e+10 | 1.99521e+10 |  0  | 2.56083e+09 |
|             INSTR_RETIRED_ANY STAT             | 1.10915e+11 | 1.07612e+11 |  0  | 1.38644e+10 |
|           CPU_CLK_UNHALTED_CORE STAT           | 8.18159e+10 | 7.89517e+10 |  0  | 1.0227e+10  |
|           CPU_CLK_UNHALTED_REF STAT            | 7.13438e+10 | 6.88412e+10 |  0  | 8.91798e+09 |
+------------------------------------------------+-------------+-------------+-----+-------------+
+----------------------+----------+----------+----------+-----------+---------+------------+---------+-------------+
|        Metric        |  core 0  |  core 1  |  core 2  |  core 3   | core 4  |   core 5   | core 6  |   core 7    |
+----------------------+----------+----------+----------+-----------+---------+------------+---------+-------------+
| Runtime (RDTSC) [s]  | 28.8565  | 28.8565  | 28.8565  |  28.8565  | 28.8565 |  28.8565   | 28.8565 |   28.8565   |
| Runtime unhalted [s] | 23.2756  | 0.339355 | 0.403973 | 0.0975846 |    0    | 0.00347912 |    0    | 1.04055e-05 |
|     Clock [MHz]      | 3890.21  | 3881.13  | 3886.19  |  3873.22  |    0    |  3787.52   |    0    |   3790.46   |
|         CPI          | 0.733667 | 0.525153 | 1.52876  |  1.60808  |    0    |  1.38763   |    0    |   12.3889   |
+----------------------+----------+----------+----------+-----------+---------+------------+---------+-------------+